#include "StructDef.h"

#define DLLProvider

#ifdef _WIN32
#ifdef DLLProvider
#define DLL_EXPORT_IMPORT __declspec(dllexport)
#else
#define DLL_EXPORT_IMPORT __declspec(dllimport)
#endif
#else
#define DLL_EXPORT_IMPORT __attribute__((visibility("default")))
#endif

#ifdef __cplusplus
extern "C"{
#endif

/***
 *  接口的具体说明请以《API说明文档》为主，本处可能存在更新延迟的情况。
 *  /

/* ****************************************************************************
 * 函数名: XCheckRobHal
 *
 * 功能: 检查接口与控制器的兼容性
 *
 * 输入参数:
 *        ip:       控制器网口地址
 *        RobCheck: 接口匹配号
 *        MotCheck: 控制器匹配号
 *
 * 返回值:  0:  成功
 *        -1:  链接失败
 *        -2： 接口版本与控制器版本不兼容
 *        -10: ROBHAL模块没有初始化
 *        -30: 句柄创建达到上限
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 *
 * 注意: 控制器NET0网口默认192.168.1.6, NET1网口默认未172.18.11.5
 **************************************************************************** */
DLL_EXPORT_IMPORT int XCheckRobHal(char *ip,int *RobCheck,int *MotCheck);

/* ****************************************************************************
 * 函数名: XCreateRobHal
 *
 * 功能: 创建与控制器的TCP连接
 *
 * 输入参数:
 *        IPStr:    控制器网口地址
 *
 * 返回值:  0:  成功
 *        -1:  链接失败
 *        -10: ROBHAL模块没有初始化
 *        -30: 句柄创建达到上限
 *
 * 注意: 控制器NET0网口默认192.168.1.6, NET1网口默认未172.18.11.5
 **************************************************************************** */
DLL_EXPORT_IMPORT int XCreateRobHal(int *RobHandle, char *ip);

/* ****************************************************************************
 * 函数名: XCreateRobHalConfig
 *
 * 功能: 创建与控制器的TCP连接（高级使用）
 *
 * 输入参数:
 *        IPStr:    控制器网口地址
 *        LinkTimeout： 连接超时时间(秒):建议 2S
 *        RetryNum: 超时额外重连次数
 *
 * 返回值:  0:  成功
 *        -1:  链接失败
 *        -10: ROBHAL模块没有初始化
 *        -30: 句柄创建达到上限
 *
 * 注意: 控制器NET0网口默认192.168.1.6, NET1网口默认未172.18.11.5
 **************************************************************************** */
DLL_EXPORT_IMPORT int XCreateRobHalConfig(int *RobHandle, char *ip, int LinkTimeout, int RetryNum);

/* ****************************************************************************
 * 函数名: XDeleteRobHal
 *
 * 功能: 删除与控制器的TCP连接
 *
 * 返回值:  0:  成功
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XDeleteRobHal(int RobHandle);

/* ****************************************************************************
 * 函数名: XWaitCmdSendDone
 *
 * 功能: 等待当前调用命令发送完成
 *
 * 返回值:  0:  成功
 *        -1:  链接失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XWaitCmdSendDone(int RobHandle);

/* ****************************************************************************
 * 函数名: XGetVersion
 *
 * 功能: 获取库版本号
 *
 * 返回值:  0:  成功
 *         -1: 获取失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 *
 * 注意: 接收Buff长度建议在100字节以上
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetVersion(int RobHandle, char* VersionStr);

/* ****************************************************************************
 * 函数名: XMainProgramRun
 *
 * 功能: 自动运行主程序
 *
 * 输入参数:
 *        ProgramName: 运行程序名称

 * 返回值:  0:  启动成功
 *        -1： 系统未处于自动运行状态
 *        -2： 系统处于远程模式
 *        -3:  程序文件载入失败
 *        -4:  系统当前已处于运行状态
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XMainProgramRun(int RobHandle);

/* ****************************************************************************
 * 函数名: XProgramRun
 *
 * 功能: 运行自动程序
 *
 * 输入参数:
 *        ProgramName: 运行程序名称

 * 返回值:  0:  启动成功
 *        -1： 系统未处于自动运行状态
 *        -2： 系统处于远程模式
 *        -3:  程序文件载入失败
 *        -4:  系统当前已处于运行状态
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XProgramRun(int RobHandle, char *ProgramName);

/* ****************************************************************************
 * 函数名: XProgramPause
 *
 * 功能: 暂停自动程序
 *
 * 返回值:  0:  成功
 *        -1:  暂停命令下发失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XProgramPause(int RobHandle);

/* ****************************************************************************
 * 函数名: XProgramResume
 *
 * 功能: 继续运行当前程序
 *
 * 返回值:  0:  启动成功
 *        -1： 系统未处于自动运行状态
 *        -2： 系统处于远程模式
 *        -3:  系统当前未运行程序
 *        -4:  系统当前已处于运行状态
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XProgramResume(int RobHandle);

/* ****************************************************************************
 * 函数名: XProgramStop
 *
 * 功能: 停止自动程序
 *
 * 返回值:  0:  成功
 *        -1:  停止命令下发失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XProgramStop(int RobHandle);

/* ****************************************************************************
 * 函数名: XGetAllAO
 *
 * 功能: 获取所有AO数据
 *
 * 输入参数:
 *        Data:    模拟量输出(AO)值
 *
 * 返回值:  0:  获取成功
 *        -1： 数据读取失败
 *        -2： 网络链接断开
 *        -3:  参数解析失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 *
 * 注意: Data数组大小应大于等于16
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetAllAO(int RobHandle, double Data[8]);

/* ****************************************************************************
 * 函数名: XGetAO
 *
 * 功能: 获取指定AO数据
 *
 * 输入参数:
 *        Index:   AO编号(0~15)
 *        Data:    模拟量输出(AO)值
 *
 * 返回值:  0:  获取成功
 *        -1： 数据读取失败
 *        -2： 网络链接断开
 *        -3:  参数解析失败
 *        -4:  输出端口号超过限定范围
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetAO(int RobHandle, int Index, double *Data);

/* ****************************************************************************
 * 函数名: XSetAO
 *
 * 功能: 指定AO数据设置
 *
 * 输入参数:
 *        Index       输出端口号(0~15)
 *        Data        模拟量输出(AO)值
 *
 * 返回值:  0:  成功
 *        -1:  命令下发失败
 *        -2:  输出端口号超过限定范围
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XSetAO(int RobHandle, int Index, double Data);

/* ****************************************************************************
 * 函数名: XGetAllAI
 *
 * 功能: 获取所有AI数据
 *
 * 输入参数:
 *        Data:    模拟量输入(AI)值
 *
 * 返回值:  0:  获取成功
 *        -1： 数据读取失败
 *        -2： 网络链接断开
 *        -3:  参数解析失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetAllAI(int RobHandle, double *Data);

/* ****************************************************************************
 * 函数名: XGetAI
 *
 * 功能: 获取指定AI数据
 *
 * 输入参数:
 *        Index:    AI编号(0~15)
 *        Data:     模拟量输入(AI)值
 *
 * 返回值:  0:  获取成功
 *        -1： 数据读取失败
 *        -2： 网络链接断开
 *        -3:  参数解析失败
 *        -4:  输出端口号超过限定范围
 *        -5:  参数获取超时(2S)
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetAI(int RobHandle, int Index, double *Data);

/* ****************************************************************************
 * 函数名: XGetAllDO
 *
 * 功能: 获取所有DO数据
 *
 * 输入参数:
 *        Data:    数字量输出(DO)数据(1:打开    0:关闭)
 *
 * 返回值:  0:  成功
 *        -1:  DO数据更新失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetAllDO(int RobHandle, int data[248]);

/* ****************************************************************************
 * 函数名: XGetDO
 *
 * 功能: 获取指定DO数据
 *
 * 输入参数:
 *        Index:   DO编号(0~247)
 *        Data:    数字量输出(DO)数据(1:打开    0:关闭)
 *
 * 返回值:  0:  成功
 *        -1:  DO数据更新失败
 *        -2:  输出端口号超过限定范围
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetDO(int RobHandle, int Index, int *Data);

/* ****************************************************************************
 * 函数名: XSetDO
 *
 * 功能: 指定DO数据设置
 *
 * 输入参数:
 *        Index       DO编号(0~247)
 *        State       输出端口状态(1:打开, 0:关闭)
 *
 * 返回值:  0:  成功
 *        -1:  命令下发失败
 *        -2:  输出端口号超过限定范围
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XSetDO(int RobHandle, int Index, int State);

/* ****************************************************************************
 * 函数名: XWaitSetDODone
 *
 * 功能: 等待IO打开命令执行完成
 *
 * 返回值:  0:  运动完成
 *        -1:  超时(5s)
 *        -2:  状态获取失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XWaitSetDODone(int RobHandle, int Timeout);

/* ****************************************************************************
 * 函数名: XGetAllDI
 *
 * 功能: 获取所有DI数据
 *
 * 输入参数:
 *        Data:    数字量输入(DI)数据
 *
 * 返回值:  0:  成功
 *        -1:  DI数据更新失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetAllDI(int RobHandle, int data[248]);

/* ****************************************************************************
 * 函数名: XGetDI
 *
 * 功能: 获取指定DI数据
 *
 * 输入参数:
 *        Index:   DI编号(0~247)
 *        Data:    数字量输入(DI)数据
 *
 * 返回值:  0:  成功
 *        -1:  DI数据更新失败
 *        -2:  输出端口号超过限定范围
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetDI(int RobHandle, int Index, int *Data);

/* ****************************************************************************
 * 函数名: XGetAllEI
 *
 * 功能: 获取所有EI数据
 *
 * 输入参数:
 *        Data:    编码器输入(EI)数据
 *
 * 返回值:  0:  成功
 *        -1:  EI数据更新失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetAllEI(int RobHandle, int data[8]);

/* ****************************************************************************
 * 函数名: GetEI
 *
 * 功能: 获取指定EI数据
 *
 * 输入参数:
 *        Index:   EI编号(0~7)
 *        Data:    编码器输入(EI)数据
 *
 * 返回值:  0:  成功
 *        -1:  EI数据更新失败
 *        -2:  输出端口号超过限定范围
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetEI(int RobHandle, int Index, int *Data);

/* ****************************************************************************
 * 函数名: XGetUFNo
 *
 * 功能: 获取当前使用用户坐标系编号
 *
 *
 * 返回值: 0~16: 用户坐标系编号
 *        -1:   用户坐标系编号获取失败
 *        -10:  ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetUFNo(int RobHandle);

/* ****************************************************************************
 * 函数名: XSetUFNo
 *
 * 功能: 设置当前使用用户坐标系
 *
 * 输入参数:
 *        Index  用户坐标系编号
 *
 * 返回值: 0:   成功
 *        -1:  坐标系设定失败
 *        -2:  坐标系索引超限
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XSetUFNo(int RobHandle, int Index);

/* ****************************************************************************
 * 函数名: XGetUF
 *
 * 功能: 获取指定用户坐标系数据
 *
 * 输入参数:
 *        Index:  用户坐标系索引
 *        Data:   获取到的坐标系参数(X,Y,Z,A,B,C)
 *
 * 返回值:  0:  获取成功
 *        -1： 系统状态获取失败
 *        -2： 网络链接断开
 *        -3:  坐标系参数获取失败
 *        -4:  坐标系索引超过限定范围
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetUF(int RobHandle, int Index, XPOSE *PosData);

/* ****************************************************************************
 * 函数名: XSetUF
 *
 * 功能: 用户坐标系数据设定
 *
 * 输入参数:
 *        Index  用户坐标系索引(1~16)
 *        Data   坐标系设定的参数(X,Y,Z,A,B,C)
 *
 * 返回值: 0:   成功
 *        -1:  坐标系索引超限
 *        -2:  坐标系参数下发失败
 *        -3:  坐标系参数更新失败
 *        -4:  坐标系设定失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XSetUF(int RobHandle, int Index, XPOSE PosData);

/* ****************************************************************************
 * 函数名: XGetTFNo
 *
 * 功能: 获取当前使用工具坐标系编号
 *
 *
 * 返回值: 0~16: 工具坐标系编号
 *        -1:   工具坐标系编号获取失败
 *        -10:  ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetTFNo(int RobHandle);

/* ****************************************************************************
 * 函数名: XSetTFNo
 *
 * 功能: 设置当前使用工具坐标系
 *
 * 输入参数:
 *        Index  工具坐标系编号
 *
 * 返回值: 0:   成功
 *        -1:  坐标系设定失败
 *        -2:  坐标系索引超限
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XSetTFNo(int RobHandle, int Index);

/* ****************************************************************************
 * 函数名: XGetTF
 *
 * 功能: 获取指定工具坐标系数据
 *
 * 输入参数:
 *        Index:  工具坐标系索引
 *        Data:   获取到的坐标系参数(X,Y,Z,A,B,C)
 *
 * 返回值:  0:  获取成功
 *        -1： 系统状态获取失败
 *        -2： 网络链接断开
 *        -3:  坐标系参数获取失败
 *        -4:  坐标系索引超过限定范围
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetTF(int RobHandle, int Index, XPOSE *PosData);

/* ****************************************************************************
 * 函数名: XSetTF
 *
 * 功能: 工具坐标系数据设定
 *
 * 输入参数:
 *        Index  工具坐标系索引(1~16)
 *        Data   坐标系设定的参数(X,Y,Z,A,B,C)
 *
 * 返回值: 0:   成功
 *        -1:  坐标系索引超限
 *        -2:  坐标系参数下发失败
 *        -3:  坐标系参数更新失败
 *        -4:  坐标系设定失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XSetTF(int RobHandle, int Index, XPOSE PosData);

/* ****************************************************************************
 * 函数名: XSetWF
 *
 * 功能: 基坐标系数据设定
 *
 * 输入参数:
 *        Data   坐标系设定的参数(X,Y,Z,A,B,C)
 *
 * 返回值: 0:   成功
 *        -1:  坐标系参数下发失败
 *        -2:  坐标系参数更新失败
 *        -3:  坐标系设定失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XSetWF(int RobHandle, XPOSE PosData);

/* ****************************************************************************
 * 函数名: XGetWF
 *
 * 功能: 获取基坐标系数据
 *
 * 输入参数:
 *        Data   基坐标系参数(X,Y,Z,A,B,C)
 *
 * 返回值: 0:   成功
 *        -1:  系统状态获取失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetWF(int RobHandle, XPOSE *PosData);

/* ****************************************************************************
 * 函数名: XGetAllR
 *
 * 功能: 获取所有R变量数据
 *
 * 输入参数:
 *        Data:   R变量数据数组
 *
 * 返回值:  0:  获取成功
 *        -1： 数据读取失败
 *        -2： 网络链接断开
 *        -3:  参数获取失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetAllR(int RobHandle, double data[32]);

/* ****************************************************************************
 * 函数名: XGetR
 *
 * 功能: 获取指定R变量数据
 *
 * 输入参数:
 *        Index:  R变量编号
 *        Data:   R变量数据
 *
 * 返回值:  0:  获取成功
 *        -1： 数据读取失败
 *        -2： 网络链接断开
 *        -3:  参数获取失败
 *        -4:  R变量编号超过限定范围
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetR(int RobHandle, int Index, double *Data);

/* ****************************************************************************
 * 函数名: XGetAllHR
 *
 * 功能: 获取所有HR变量数据
 *
 * 输入参数:
 *        Data:   HR变量数据数组
 *
 * 返回值:  0:  获取成功
 *        -1： 数据读取失败
 *        -2： 网络链接断开
 *        -3:  参数解析失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetAllHR(int RobHandle, double data[64]);

/* ****************************************************************************
 * 函数名: XGetHR
 *
 * 功能: 获取指定HR变量数据
 *
 * 输入参数:
 *        Index:  HR变量编号
 *        Data:   HR变量数据
 *
 * 返回值:  0:  获取成功
 *        -1： 数据读取失败
 *        -2： 网络链接断开
 *        -3:  参数获取失败
 *        -4:  HR变量编号超过限定范围
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetHR(int RobHandle, int Index, double *Data);

/* ****************************************************************************
 * 函数名: XSetAllHR
 *
 * 功能: 设置所有HR变量数据
 *
 * 输入参数:
 *        Data:   HR变量数据数组
 *
 * 返回值:  0:  设置成功
 *        -1： 设置失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XSetAllHR(int RobHandle, double data[64]);

/* ****************************************************************************
 * 函数名: XSetHR
 *
 * 功能: 设置指定HR变量数据
 *
 * 输入参数:
 *        Index:  HR变量编号
 *        Data:   HR变量数据
 *
 * 返回值:  0:  设置成功
 *        -1： 设置失败
 *        -2:  HR变量编号超过限定范围
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XSetHR(int RobHandle, int Index, double Data);

/* ****************************************************************************
 * 函数名: XGetPR
 *
 * 功能: 获取指定PR变量数据
 *
 * 输入参数:
 *        Index:  PR编号(0~31)
 *        Data:   PR变量结构体指针
 *
 * 返回值:  0:  获取成功
 *        -1： 数据读取失败
 *        -2： 网络链接断开
 *        -3:  参数获取失败
 *        -4:  运动参数获取失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetPR(int RobHandle, int Index, XPOINT *Data);

/* ****************************************************************************
 * 函数名: XGetJPR
 *
 * 功能: 获取指定JPR变量数据
 *
 * 输入参数:
 *        Index:  PR编号(0~15)
 *        Data:   PR变量结构体指针
 *
 * 返回值:  0:  获取成功
 *        -1： 数据读取失败
 *        -2： 网络链接断开
 *        -3:  参数获取失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetJPR(int RobHandle, int Index, XJOINT *Data);

/* ****************************************************************************
 * 函数名: XGetPENV
 *
 * 功能: 获取指定PENV变量数据
 *
 * 输入参数:
 *        Index:    PENV索引值(0~63)
 *        Data:     PENV变量结构体指针
 *
 * 返回值:  0:  获取成功
 *        -1： 数据读取失败
 *        -2： 网络链接断开
 *        -3:  参数获取失败
 *        -4:  运行参数获取失败
 *        -5： PENV变量编号超过限定范围
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetPENV(int RobHandle, int Index, XPOINT *Data);

/* ****************************************************************************
 * 函数名: XSetPENV
 *
 * 功能: 设置指定PENV变量数据
 *
 * 输入参数:
 *        Index:    PENV索引值(0~63)
 *        Data:     PENV变量结构体指针
 *
 * 返回值:  0:  设置成功
 *        -1： 参数更新失败
 *        -2： 参数下发失败
 *        -3： 参数保存失败
 *        -4： PENV变量编号超过限定范围
 *        -5： 参数获取超时(2S)
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XSetPENV(int RobHandle, int Index, XPOINT Data);

/* ****************************************************************************
 * 函数名: XGetJPENV
 *
 * 功能: 获取指定JPENV变量数据
 *
 * 输入参数:
 *        Index:    JPENV索引值(0~15)
 *        Data:     JPENV变量结构体指针
 *
 * 返回值:  0:  获取成功
 *        -1： 数据读取失败
 *        -2： 网络链接断开
 *        -3:  参数获取失败
 *        -4:  JPENV变量编号超过限定范围
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetJPENV(int RobHandle, int Index, XJOINT *Data);

/* ****************************************************************************
 * 函数名: XSetJPENV
 *
 * 功能: 设置指定JPENV变量数据
 *
 * 输入参数:
 *        Index:    JPENV索引值(0~15)
 *        Data:     JPENV变量结构体指针
 *
 * 返回值:  0:  设置成功
 *        -1： 参数下发失败
 *        -2： 参数保存失败
 *        -3： JPENV变量编号超过限定范围
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XSetJPENV(int RobHandle, int Index, XJOINT Data);

/* ****************************************************************************
 * 函数名: XGetSystemState
 *
 * 功能: 读取控制器系统状态
 *
 * 输入参数:
 *        Stat: 要更新的变量结构体,具体内容看X1SYSTEMSTATE结构体
 *
 * 返回值:  0:  成功
 *        -1:  状态更新失败
 *        -2: 运行参数获取失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetSystemState(int RobHandle, XSYSTEMSTATE *State);

/* ****************************************************************************
 * 函数名: XGetCPoint
 *
 * 功能: 获取当前位置点数据(用户与工具坐标系下的描述)
 *
 * 输入参数:
 *        Data: 位置点数据
 *
 * 返回值:  0:  成功
 *        -1:  数据更新失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetCPoint(int RobHandle, XPOINT *Data);

/* ****************************************************************************
 * 函数名: XGetWPoint
 *
 * 功能: 获取当前世界坐标下的位置点数据
 *
 * 输入参数:
 *        Data: 位置点数据
 *
 * 返回值:  0:  成功
 *        -1:  数据更新失败
 *        -2:  运行参数获取失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetWPoint(int RobHandle, XPOINT *Data);

/* ****************************************************************************
 * 函数名: XGetCJoint
 *
 * 功能: 获取当前Joint位置点信息
 *
 * 输入参数:
 *        Data: 位置点数据
 *
 * 返回值:  0:  成功
 *        -1:  数据更新失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetCJoint(int RobHandle, XJOINT *Data);

/* ****************************************************************************
 * 函数名: XGetSpeed
 *
 * 功能: 获取系统运行速度
 *
 * 返回值:  1~100:  运行速度
 *        -1:  运行速度获取失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetSpeed(int RobHandle);

/* ****************************************************************************
 * 函数名: XSetSpeed
 *
 * 功能: 设置系统运行速度
 *
 * 输入参数:
 *        Scale: 速度值,1~100
 *
 * 返回值:  0:  成功
 *        -1:  设置命令下发失败
 *        -2:  设定速度值超过限定范围
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XSetSpeed(int RobHandle, int Scale);

/* ****************************************************************************
 * 函数名: XSetMDIFast
 *
 * 功能: 设定手动快速模式
 *
 * 输入参数:
 *        Type  0:关闭    1:开启
 *
 * 返回值:  0:  成功
 *        -1:  设定值超过限定范围
 *        -2:  命令下发失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 ****************************************************************************
DLL_EXPORT_IMPORT int XSetMDIFast(int RobHandle, int Type);
*/

/* ****************************************************************************
 * 函数名: XServoOn
 *
 * 功能: 系统上使能
 *
 *
 * 返回值:  0:  成功
 *        -1:  设置命令下发失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XServoOn(int RobHandle);

/* ****************************************************************************
 * 函数名: XServoOff
 *
 * 功能: 系统下使能
 *
 *
 * 返回值:  0:  成功
 *        -1:  设置命令下发失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XServoOff(int RobHandle);

/* ****************************************************************************
 * 函数名: XStopMove
 *
 * 功能: 停止系统当前运动动作
 *
 * 返回值:  0:  成功
 *        -1:  停止命令下发失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XStopMove(int RobHandle);

/* ****************************************************************************
 * 函数名: XAbort
 *
 * 功能: 系统当前所有动作停止
 *
 * 返回值:  0:  成功
 *        -1:  停止命令下发失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XAbort(int RobHandle);

/* ****************************************************************************
 * 函数名: XReset
 *
 * 功能: 系统复位
 *
 * 返回值:  0:  成功
 *        -1:  复位命令下发失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XReset(int RobHandle);

/* ****************************************************************************
 * 函数名: XSetSysMode
 *
 * 功能: 当前系统运行状态设定
 *
 * 输入参数:
 *        Mode   X_MODE_AUTO     自动模式
 *               X_MODE_MANUAL   手动模式
 *               X_MODE_DEBUG    调试模式
 *	             X_MODE_AUTOCMD  自动(CMD)模式
 *
 * 返回值: 0:   成功
 *        -1:  切换失败
 *        -2:  未知模式
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XSetSysMode(int RobHandle, int Mode);

/* ****************************************************************************
 * 函数名: XSetRemote
 *
 * 功能: 系统远程模式切换
 *
 * 输入参数:
 *        Type      远程状态(0: 非远程模式,  1:  远程模式)
 *
 * 返回值:   0: 切换成功
 *          -1:  命令下发失败
 *          -10: ROBHAL模块没有初始化
 *          -31: 句柄值异常
 *          -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XSetRemote(int RobHandle, int Type);

/* ****************************************************************************
 * 函数名: XMovSJ
 *
 * 功能:  单个关节轴运动指令
 *
 * 输入参数:
 *        Num   轴号
 *        Data  轴关节运动到位置
 *
 * 返回值: 0:   成功
 *        -1:  命令执行失败
 *        -2:  状态获取失败
 *        -3:  运行模式非手动(MDI)模式
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XMovSJ(int RobHandle, int Num, double Data);

/* ****************************************************************************
 * 函数名: XJogLRel
 *
 * 功能: 在X、Y、Z、A、B、C、E1、E2、E3轴方向上移动指定的距离
 *
 * 输入参数:
 *        Num   轴号(0:X  1:Y  2:Z  3:A   4:B   5:C   6:E1   7:E2   8:E3)
 *        Data  增量值
 *        Type  坐标系类型(1:世界坐标系  2:工具坐标系  3:用户坐标系)
 *        Rtcp  外部工具坐标系使用标识位(0:不使用  1:使用)
 *
 * 返回值: 0:   成功
 *        -1:  命令执行失败
 *        -2:  系统状态获取失败
 *        -3:  坐标系类型参数超过限定范围
 *        -4:  运行模式非手动(MDI)模式
 *        -10:  ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XJogLRel(int RobHandle, int Num, double Data, int Type, int Rtcp);

/* ****************************************************************************
 * 函数名: XJogL
 *
 * 功能: 在X、Y、Z、A、B、C、E1、E2、E3轴方向上持续移动
 *
 * 输入参数:
 *        Num   轴号(0:X  1:Y  2:Z  3:A   4:B   5:C   6:E1   7:E2   8:E3)
 *        Dir   运动方向(0:正方向   非0:负方向)
 *        Type  坐标系类型(1:世界坐标系  2:工具坐标系  3:用户坐标系)
 *        Rtcp  外部工具坐标系使用标识位(0:不使用  1:使用)
 *
 * 返回值: 0:   成功
 *        -1:  命令执行失败
 *        -2:  系统状态获取失败
 *        -3:  坐标系类型参数超过限定范围
 *        -4:  运行模式非手动(MDI)模式
 *        -10:  ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XJogL(int RobHandle, int Num, int Dir, int Type, int Rtcp);

/* ****************************************************************************
 * 函数名: XMovL
 *
 * 功能: 使用MOVL运动指令运行到笛卡尔位置点
 *
 * 输入参数:
 *        MPos   笛卡尔位置点数据
 *
 * 返回值: 0:   成功
 *        -1:  命令执行失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XMovL(int RobHandle, XPOINT MPos);

/* ****************************************************************************
 * 函数名: XMovLAdd
 *
 * 功能: 使用MOVL附加动作运动指令运行到关节位置点
 *
 * 输入参数:
 *        MPos   关节位置点数据
 *        Data   附加动作参数
 *
 * 返回值: 0:   成功
 *        -1:  命令执行失败
 *        -10:  ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XMovLAdd(int RobHandle, XPOINT MPos, XMOVPOINTADD Data);
DLL_EXPORT_IMPORT int XMovLAdditional(int RobHandle, XPOINT MPos, XMOVPOINTADD Data);


/* ****************************************************************************
 * 函数名: XMovJJoint
 *
 * 功能: 使用MOVJ运动指令运行到关节位置点
 *
 * 输入参数:
 *        JPos   关节位置点数据
 *
 * 返回值: 0:   成功
 *        -1:  命令执行失败
 *        -10:  ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XMovJJoint(int RobHandle, XJOINT JPos);

/* ****************************************************************************
 * 函数名: XMovJJointAdd
 *
 * 功能: 使用MOVJ附加动作运动指令运行到关节位置点
 *
 * 输入参数:
 *        JPos   关节位置点数据
 *        Data   附加动作参数
 *
 * 返回值: 0:   成功
 *        -1:  命令执行失败
 *        -10:  ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XMovJJointAdd(int RobHandle, XJOINT JPos, XMOVPOINTADD Data);
DLL_EXPORT_IMPORT int XMovJJointAdditional(int RobHandle, XJOINT JPos, XMOVPOINTADD Data);

/* ****************************************************************************
 * 函数名: XMovJPoint
 *
 * 功能: 使用MOVJ运动指令运行到笛卡尔位置点
 *
 * 输入参数:
 *        MPos   笛卡尔位置点数据
 *
 * 返回值: 0:   成功
 *        -1:  命令执行失败
 *        -10:  ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XMovJPoint(int RobHandle, XPOINT MPos);

/* ****************************************************************************
 * 函数名: XMovJPointAdd
 *
 * 功能: 使用MOVJ附加动作运动指令运行到笛卡尔位置点
 *
 * 输入参数:
 *        MPos   笛卡尔位置点数据
 *        Data   附加动作参数
 *
 * 返回值: 0:   成功
 *        -1:  命令执行失败
 *        -10:  ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XMovJPointAdd(int RobHandle, XPOINT MPos, XMOVPOINTADD Data);
DLL_EXPORT_IMPORT int XMovJPointAdditional(int RobHandle, XPOINT MPos, XMOVPOINTADD Data);

/* ****************************************************************************
 * 函数名: XJump
 *
 * 功能: 使用Jump运动指令运行到笛卡尔位置点
 *
 * 输入参数:
 *        MPos      笛卡尔点位数据
 *        JumpData  门型运动参数{上升高度，下降高度，最大高度}
 *
 * 返回值: 0:   成功
 *        -1:  命令执行失败
 *        -10:  ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XJump(int RobHandle, XPOINT MPos, double JumpData[3]);

/* ****************************************************************************
 * 函数名: XJumpAdd
 *
 * 功能: 使用Jump附加动作运动指令运行到笛卡尔位置点
 *
 * 输入参数:
 *        MPos      笛卡尔点位数据
 *        JumpData  门型运动参数{上升高度，下降高度，最大高度}
 *        AddData   附加动作参数
 *
 * 返回值: 0:   成功
 *        -1:  命令执行失败
 *        -10:  ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XJumpAdd(int RobHandle, XPOINT MPos, double JumpData[3], XMOVPOINTADD AddData);

/* ****************************************************************************
 * 函数名: XJumpL
 *
 * 功能: 使用JumpL运动指令运行到笛卡尔位置点
 *
 * 输入参数:
 *        MPos      笛卡尔点位数据
 *        JumpData  门型运动参数{上升高度，下降高度，最大高度}
 *
 * 返回值: 0:   成功
 *        -1:  命令执行失败
 *        -10:  ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XJumpL(int RobHandle, XPOINT MPos, double JumpData[3]);

/* ****************************************************************************
 * 函数名: XJumpLAdd
 *
 * 功能: 使用JumpL附加动作运动指令运行到笛卡尔位置点
 *
 * 输入参数:
 *        MPos      笛卡尔点位数据
 *        JumpData  门型运动参数{上升高度，下降高度，最大高度}
 *        AddData   附加动作参数
 *
 * 返回值: 0:   成功
 *        -1:  命令执行失败
 *        -10:  ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XJumpLAdd(int RobHandle, XPOINT MPos, double JumpData[3], XMOVPOINTADD AddData);

/* ****************************************************************************
 * 函数名: XWaitMovDone
 *
 * 功能: 等待运动命令执行完成
 *
 * 返回值:  0:  命令下发完成
 *        -1:  超时(60s)
 *        -2:  状态获取失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XWaitMovDone(int RobHandle, int Timeout);

/* ****************************************************************************
 * 函数名: XCmdExecute
 *
 * 功能: 字符串下发接口
 *
 * 返回值:  0:  命令下发完成
 *        -1:  下发失败
 *        -10: ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XCmdExecute(int RobHandle, char *CmdStr);

/* ****************************************************************************
 * 函数名: XGetSysErrIndex
 *
 * 功能: 获取系统报警码
 *
 * 返回值:  0:  获取完成
 *        -2:  状态获取失败
 *        -3:  配置参数获取失败
 *        -10:  ROBHAL模块没有初始化
 *        -31: 句柄值异常
 *        -32: 句柄不存在
 **************************************************************************** */
DLL_EXPORT_IMPORT int XGetSysErrIndex(int RobHandle, int *Length, XSYSERRINDEX *ErrData);

/* ****************************************************************************
 * 函数名: XEnableDebugOutput
 *
 * 功能: 控制SDK接口是否输出默认高级调试信息
 *
 * 输入参数:
 *       Enable   控制调试输出开关(0:关闭, 非0:打开)
 *
 * 注意：该函数用于在调试时控制SDK接口是否输出自带调试信息。
 **************************************************************************** */
DLL_EXPORT_IMPORT void XEnableDebugOutput(int Enable);

#ifdef __cplusplus
}
#endif
